---
kind: type
id: T:Autodesk.Revit.DB.LayoutRuleMaximumSpacing
source: html/f9b60a91-9095-9035-e5a9-e05b6c631caf.htm
---
# Autodesk.Revit.DB.LayoutRuleMaximumSpacing

This class indicate the layout rule of a Beam System is Max-Spacing.

## Syntax (C#)
```csharp
public class LayoutRuleMaximumSpacing : LayoutRule
```

## Remarks
To use this type of LayoutRule, only the maximum spacing must be set and it must be in (0, 30000).